Repository: AzharInam/Tinamit
Catalog: docs/source/locale/*/LC_MESSAGES/agradecimientos.po
Languages: ur

source: Agradecimientos
ur: شکریہ

source: Tinamit es un proyecto de fuente abierta. Las personas e instituciones siguientes hicieron posible su desarrollo.
ur: ٹینامٹ ایک اوپن سورس پراجیکٹ ہے ۔ مندرجہ ذیل افراد اور اداروں نے اس کی تخلیق کو ممکن بنا یا

source: Autores del código
ur: کوڈ کے تخلیق کار

source: Julien Malard (`Sitio internet <https://www.researchgate.net/profile/Julien_Malard>`_)
ur: (_`<https://www.researchgate.net/profile/Julien_Malard> جولیں ميلاد (`انٹرنیٹ سایٹ

source: محمّد اظہر انعام بیگ (`Sitio internet <https://www.researchgate.net/profile/Azhar_Baig>`_)
ur: (_`<https://www.researchgate.net/profile/Azhar_Baig>`محمّد اظہر انعام بیگ ('انٹرنیٹ سایٹ

source: Autores de envolturas
ur: سانچے کے تخلیق کار

source: Gracias a los siguientes por escribir envolturas específicas a los modelos biofísicos siguientes (nota: escribimos las *envolturas* para que estos modelos sean compatibles con Tinamit, ¡no los modelos sí mismos!)
ur: مندرجہ ذیل حیاتی طبیعیات ماڈلز کےسانچےلکھنے لئے مندرجہ ذیل تخلیق کاروں کا شکریہ: (نوٹ: ہم نے ان حیاتی طبیعیات ماڈلز کو سماجی معاشی ماڈلز بذريعہ ٹینامٹ ) (جوڑنے کے لئے٭ سانچے٭ بناے ہیں۔ حیاتی طبیعیات ماڈلز کی تخلیق کار ی میں ھمارا کوی کردار نہيں ھے

source: SAHYSMOD
ur: ساھیسماڈ

source: SAHYSMOD es un modelo de predicción de salinidad de los suelos.
ur: ساھیسماڈ زمین کی نمکيات اور زیر زمین پانی کی پیش گوئی کاماڈل ہے

source: Julien Malard
ur: جولیں ميلاد

source: Traductores
ur: مترجم

source: Cuando se habrán traducido Tinamit y su documentación, los agradecimientos irán aquí.
ur: ٹینامٹ اور اس کی دستاويز کا ترجمہ کرنے والوں کی خدمات کا يھاں اعتراف کیا جاۓ گا

source: Instituciones afiliadas
ur: منسلک ادارے

source: Los autores de Tinamit están afiliados con las instituciones siguientes:
ur: ٹینامٹ کے تخلیق کارمندرجہ ذیل اداروں سے منسلک ہیں
