Repository: AzharInam/Tinamit
Catalog: docs/source/locale/*/LC_MESSAGES/BF.po
Languages: fr

source: BF (Modelos Biofísicos)
fr: BP (Modèles biophysiques)

source: Se debe desarrollar una subclase de esta clase para cada tipo modelo biofísico que se quiere volver compatible con Tinamit.
fr: Vous devrez développer une sous-classe de cette classe pour chaque genre de modèle biophysique que vous voulez rendre compatible avec Tinamit.

source: Esta función debe cambiar el valor de variables en el modelo biofísico.
fr: Cette fonction doit changer les valeurs des variables dans le modèle biophysique.

source: Parámetros
fr: Paramètres

source: Un diccionario de variables y valores para cambiar, con el formato siguiente:
fr: Un dictionnaire de variables et de leurs nouvelles valeurs, avec le format suivant :

source: Esta función debe cerrar la simulación. No se aplica a todos los modelos biofísicos (en ese caso, usar ``pass`` ).
fr: Cette fonction foit terminer la simulation. Ne s'applique pas à tous les modèles biophysiques (dans ce cas, utiliser ``pass`` ).

source: Esta función debe iniciar el diccionario interno de variables.
fr: Cette fonction doit initialiser le dictionnaire de variables interne.

source: MUY IMPORTANTE: Esta función debe modificar el diccionario que ya existe para símismo.variables, no crear un diccionario nuevo. Por ejemplo, NO HAGAS: | símismo.variables = {var1: {...}, var2: {...}, ...}
fr: *Très important* : Cette fonction doit modifier le dictionnaire pré-existant de símismo.variables, et non créer un nouveau dictionnaire. Par exemple, *ne faites pas* | símismo.variables = {var1: {...}, var2: {...}, ...}

source: sino: | símismo.variables[var1] = {...} | símismo.variables[var2] = {...}
fr: mais plutôt : | símismo.variables[var1] = {...} | símismo.variables[var2] = {...}

source: Al no hacer esto, romperás la conección entre los diccionarios de variables de ClaseModeloBF y EnvolturaBF, lo cual impedirá después la conexión de estos variables con el modelo DS.
fr: Dans le cas contraire, vous briserez la conection entre les dictionnaires de variable de ClaseModeloBF et de EnvolturaBF, ce qui empêchera ensuite la conection de ces variables avec le modèle DS.

source: Esta función debe preparar el modelo para una simulación.
fr: Cette fonction doit préparer le modèle pour la simulation.

source: Esta función debe leer los variables del modelo desde el modelo externo y copiarlos al diccionario interno de variables. Asegúrese que esté *actualizando* el diccionario interno, y que no lo esté recreando, lo cual quebrará las conexiones con el modelo conectado.
fr: Cette fonction doit lire les variables du modèle externe et les copier au dictionnaire interne de variables. Assurez-vous que vous êtes en train *d'actualiser* le dictionnaire interne, et non en train de le recréer, car cela brisera les connexions avec le modèle connecté.

source: Esta función debe devolver la unidad de tiempo del modelo biofísico.
fr: Cette fonction doit rendre l'unité de temps du modèle biophysique.

source: Devuelve
fr: Retourne

source: La unidad de tiempo del modelo.
fr: L'unité de temps du modèle.

source: Tipo del valor devuelto
fr: Type de valeur retournée

source: Esta clase ofrece una envoltura para **TODOS** tipos de modelos biofísicos.
fr: Cette classe offre une couverture pour **TOUS** genres de modèles biophysiques.

source: Modelos biofísicos específicos se implementan por crear una subclase de `~tinamit.BF.ClaseModeloBF` específica para ellos.
fr: Les modèles biophysiques spécifiques s'implémentent en créant une sous-classe de `~tinamit.BF.ClaseModeloBF` spécifique au modèle biophysique désiré.

source: Esta función cambia el valor de variables en el modelo.
fr: Cette fonction change les valeurs des variables dans le modèle.

source: Cierre el modelo interno.
fr: Ferme le modèle interne.

source: Esta función avanza el modelo por un periodo de tiempo especificado en `paso`.
fr: Cette fonction avance le modèle d'un laps de temps déterminé par `paso`.

source: El paso.
fr: Le pas.

source: Inicializa los variables del modelo biofísico y los conecta al diccionario de variables del modelo.
fr: Inicialise les variables du modèle biophysique et les connecte avec le dictionnaire des variables du modèle.

source: Inicializa el modelo biofísico interno.
fr: Initialise le modèle biophysique interne.
