Repository: AzharInam/Tinamit
Catalog: tinamit/local/_fuente/*/LC_MESSAGES/tinamit.po
Languages: ur

source: El archivo especificado ({}) no contiene una clase llamada Modelo.
ur: مخصوص دستاويز ({}) میں ماڈل نامی طبقہ نہیں ہے.

source: El archivo especificado ("{}") contiene una clase llamada Modelo, peroesta clase no es una subclase de ClaseModeloBF.
ur: مخصوص دستاويز ("{}") میں ماڈل کا نام ایک کلاس ہے، لیکن اس کلاس کلاسومودیل بی ایف کے ذیلی کلاس نہیں ہے۔

source: El paso debe ser un número entero.
ur: قدم ایک مکمل نمبر ہونا چاہئے۔

source: Ya hay dos modelo conectados. Desconecta uno primero o emplea una instancia deSuperConectado para conectar más que 2 modelos.
ur: پہلے سے ہی دو ماڈل منسلک ہیں. ایک سے پہلے منسلک کریں یا 2 سے زائد ماڈلز سے منسلک کرنے کے لئے سپر کنکشن کا ایک مثال استعمال کریں.

source: El modelo {} ya existe. El nuevo modelo reemplazará el modelo anterior.
ur: ماڈل {} پہلے ہی موجود ہے. نیا ماڈل پچھلے ماڈل کو تبدیل کرے گا.

source: El modelo "{}" no existe en este modelo conectado.
ur: ماڈل "{}" اس منسلک ماڈل میں موجود نہیں ہے.

source: Hay que conectar dos modelos antes de empezar una simulación.
ur: آپ کو ایک تخروپن شروع کرنے سے پہلے دو ماڈلز سے رابطہ کرنا ہوگا.

source: Hay que especificar la conversión de unidades de tiempo con .estab_conv_tiempo() antes de correr la simulación.
ur: آپ کو تخروپن کو چلنے سے قبل وقت کے units .estab_conv_time () کے ساتھ تبدیل کرنا ضروری ہے.

source: No se pudo inferir la conversión de unidades de tiempo entre {} y {}. Especificarla con la función .estab_conv_tiempo(). Por el momento pusimos el factor de conversión a 1, pero probablemente no es lo que quieres.
ur: {} اور {} کے درمیان وقت کے یونٹوں کے تبادلوں کو نفاذ نہیں کیا جا سکا. function.estab_conv_time () کے ساتھ اس کی وضاحت کریں. اس وقت کے لئے جب ہم تبادلوں کا عنصر 1 پر ڈالتے ہیں، لیکن شاید یہ وہ نہیں کہ جو آپ چاہتے ہیں.

source: Hay que especificar la fecha inicial para simulaciones de clima
ur: آپ کو موسمیاتی سمیلیوں کے لئے شروع کی تاریخ کی وضاحت کرنا ہے۔

source: La fecha inicial debe ser en formato "día/mes/año", por ejemplo "24/12/2017".
ur: ابتدائی تاریخ "دن / ماہ / سال" شکل میں ہونا چاہئے، مثال کے طور پر "24/12/2017".

source: Nombre de modelo "{}" erróneo.
ur: ماڈل کا نام "{}" غلط ہے۔

source: El variable "{}" no existe en el modelo "{}".
ur: متغیر "{}" موجود نہیں ہے "{}" ماڈل۔

source: El variable "{}" del modelo "{}" ya está conectado. Desconéctalo primero con .desconectar_vars().
ur: متغیر "{}" ماڈل کے "{}" پہلے ہی منسلک ہے. پہلے سے اس کا منقطع کریں. dconconnect_vars ()

source: Las dimensiones de los dos variables ({}: {}; {}: {}) no son compatibles.
ur: دو متغیرات کے طول و عرض ({}: {}؛ {}: {}) ہم آہنگ نہیں ہیں۔

source: No se pudo identificar una conversión automática para las unidades de los variables"{}" (unidades: {}) y "{}" (unidades: {}). Se está suponiendo un factor de conversión de 1.
ur: متغیرات "{}" (یونٹس: {}) اور "{}" (یونٹس: {}) کے اکائیوں کے لئے ایک خود کار طریقے سے تبادلوں کی نشاندہی نہیں کی جا سکتی. یہ 1 کے تبادلوں کا عنصر فرض کر رہا ہے۔

source: La conexión especificada no existe.
ur: مخصوص کنکشن موجود نہیں ہے۔

source: El variable "{}" no existe.
ur: متغیر "{}" موجود نہیں ہے۔

source: El formato de datos "{}" no se puede leer al momento.
ur: ڈیٹا فارمیٹ "{}" اس وقت پڑھا نہیں جا سکتا۔

source: El variable inicializado "{}" no existe en los variables del modelo. Pero antes de quejarte al gerente, sería buena idea verificar si lo escrbiste bien.
ur: ابتدائی متغیر "{}" ماڈل کے متغیرات میں موجود نہیں ہے. لیکن مینیجر سے شکایت کرنے سے پہلے، اگر آپ نے صحیح طریقے سے لکھا تو یہ ثابت کرنے کا ایک اچھا خیال ہوگا۔

source: El variable "{}" no existe en este modelo. ¿De pronto lo escribiste mal?
ur: متغیر "{}" اس ماڈل میں موجود نہیں ہے. تم نے اچانک غلط لکھا؟

source: El variable climático "{}" no es una posibilidad. Debe ser uno de: {}
ur: موسمی متغیر "{}" امکان نہیں ہے. اس میں سے ایک ہونا چاہئے: {}

source: "Combin" debe ser "prom", "total", o None, no "{}".
ur: "Combin"ہرصورت ميں"prom","total"يا"None" چاہيے۔ نہيں "{}"۔

source: Entregar el valor para {}
ur: {} کے متغير کو قيمت دیں۔

source: "{}" no es un valor aceptable para "{}". Intente de nuevo:
ur: "{}" کے لئے قابل قبول قدر نہیں ہے "{}". دوبارہ کوشش کریں:

source: El archivo "" no existe.
ur: دستاويز "" موجود نہیں ہے۔

source: Tinamït no tiene variable "{}" de configuración.
ur: ٹينامٹ میں ترتیب کا متغیر نہیں ہے "{}".

source: Esta computadora no tiene el DLL de Vensim DSS.
ur: اس کمپیوٹر میں Vensim DSS DLL نہیں ہے۔

source: Error iniciando VENSIM.
ur: وینسیم شروع کرنے میں خرابی۔

source: Error cargando el modelo de VENSIM.
ur: وینسیم ماڈل کو لوڈ کرنے میں خرابی.

source: Error en la comanda "vensim_be_quiet".
ur: کمانڈ میں غلطی "vensim_be_quiet".

source: Error obteniendo eñ tamaño de los variables VENSIM.
ur: وینسیم کےمتغیرسائز کو حاصل کرنے میں خرابی.

source: Error obteniendo los nombres de los variables de VENSIM.
ur: وینسیم متغیرات کے نام حاصل کرنے میں خرابی.

source: Error obteniendo los nombres de los variables editables ("Gaming") de VENSIM.
ur: وینسیم کے قابل تدوین متغیرات ("گیمنگ") کے نام حاصل کرنے میں خرابی۔

source: Error iniciando la corrida VENSIM.
ur: وینسیم کے تغير پن کو شروع کرنے میں خرابی.

source: Error estableciendo el tiempo final para VENSIM.
ur: وینسیم کے لئے آخری وقت کی ترتیب میں خرابی۔

source: Error inicializando el juego VENSIM.
ur: وینسیم کھیل کو شروع کرنے میں خرابی۔

source: Error cambiando el variable %s.
ur: متغیر تبدیل کرنے میں خرابی %s.

source: Error estableciendo el paso de VENSIM.
ur: وینسیم کے قدم کو قائم کرنے میں خرابی۔

source: Error para incrementar VENSIM.
ur: وینسیم میں اضافہ کرنے میں خرابی۔

source: Error con VENSIM para leer variables.
ur: متغیر پڑھنے کے لئے وینسیم کے ساتھ خرابی.

source: Error para terminar la simulación VENSIM.
ur: وینسیم تخروپن کو ختم کرنے میں خرابی.

source: Error verificando el estatus de VENSIM. De verdad, la cosate va muy mal.
ur: وینسیم حیثیت کی توثیق کرنے میں خرابی. واقعی، چیز بہت خراب ہے.

source: Código "{}" no reconocido para la comanda Vensim de obtener atributos de variables.
ur: کوڈ "{}" متغیر کی صفات حاصل کرنے کے لئے کمانڈ ویسنم کے لئے تسلیم نہیں کیا گیا.

source: las unidades
ur: اکا‏‏ئياں۔

source: la descipción
ur: وضاحت۔

source: la ecuación
ur: مساوات۔

source: las causas
ur: وجوہات۔

source: las consecuencias
ur: نتائج۔

source: la causas iniciales
ur: ابتدائی وجوہات۔

source: las causas activas
ur: فعال وجوہات۔

source: los subscriptos
ur: سبسکرائب۔

source: las combinaciones de subscriptos
ur: سبسکرائب مجموعہ۔

source: los subscriptos de gráfico
ur: گرافک سبسکرائب۔

source: el mínimo
ur: کم از کم۔

source: el máximo
ur: زیادہ سے زیادہ۔

source: el rango
ur: رینج۔

source: el tipo
ur: قسم۔

source: Error leyendo el tamaño de memoria para obtener {} del variable "{}" en Vensim
ur: میموری سائز کو پڑھنے میں خرابی {} کے متغیرکو حاصل کرنے کے لئے "{}" ویسنیم میں۔

source: Error leyendo {} del variable "{}" en Vensim.
ur: {} متغیر سے {} "پڑھنے میں خرابی۔

source: Código de error {}.
ur: غلطی کوڈ {}۔

source: El tipo de modelo "{}" no se acepta como modelo DS en Tinamit al momento. Si piensasque podrías contribuir aquí, ¡contáctenos!
ur: ماڈل کی قسم "{}" ميں وقت کی اکا‏ئی ٹينامٹ میں ڈی ایس ماڈلميں وقت کی اکا‏ئی سے مختلف ہے. اگر آپ سوچتے ہیں کہ آپ یہاں شراکت کرسکتے ہیں تو ہم سے رابطہ کریں۔

source: El variable "{}" está erróneo. Debe ser uno de: {}
ur: متغیر "{}" غلط ہے. اس میں سے ایک ہونا چاہئے: {}۔

source: La columna "{}" no existe en la base de datos.
ur: کالم "{}" ڈیٹا بیس میں موجود نہیں ہے۔

source: Los nombres de las regiones en "orden_jer" ({}) no concuerdan con los nombres en el archivo ({}).
ur: "order_jer" میں علاقوں کے نام ({}) دستاويز میں نام سے متفق نہيں ({})۔

source: La columna de código de región especificada ({}) no concuerda con los nombres de columnas del archivo ({}).
ur: مخصوص علاقائی کوڈ کالم ({}) کالم کے نام سے فائل میں نہیں ملتا ہے ({})۔

source: El número de regiones no corresponde con el tamñao de los valores.
ur: علاقوں کی تعداد اقدار کی جسامت کے مطابق نہیں ہے۔

source: Unidades incompatibles: "{}" y "{}".
ur: ناممکن یونٹس: "{}" اور "{}"۔
